Repository: SAP/power-monitoring-tool-for-macos
Catalog: source/Power Monitor/*.lproj/Localizable.strings
Languages: de

# powerDescription
source: This Mac's power is measured every %@. A maximum of the values of the last %@ of active use are stored. As soon as the maximum number of stored values is reached, the oldest values are overwritten. Due to technical limitations, it is not possible to measure the exact wattage of this Mac directly on the Mac. Our tests with an external power meter have shown that the actual wattage can be up to 10 %% higher than the value displayed in this application. The deviation varies depending on the Mac model used and the system load.
de: Die Leistung dieses Macs wird alle %@ gemessen. Es werden maximal die Werte der letzten %@ aktiver Nutzung gespeichert. Sobald das Maximum an gespeicherten Daten erreicht ist, werden die ältesten Werte überschrieben. Aufgrund technischer Beschränkungen ist es nicht möglich, die exakte Leistungsaufnahme dieses Macs direkt auf dem Mac zu messen. Unsere Tests mit einem externen Leistungsmessgerät haben gezeigt, dass die tatsächliche Leistungsaufnahme um bis zu 10 %% höher sein kann als der in diesem Programm angezeigte Wert. Die Abweichung variiert je nach verwendetem Mac-Modell und der Auslastung des Systems.

# quitButton
source: Quit
de: Beenden

# cancelButton
source: Cancel
de: Abbrechen

# clearButton
source: Clear
de: Löschen

# backgroundButton
source: Run in background
de: Im Hintergrund ausführen

# tryAgainButton
source: Try Again
de: Erneut versuchen

# openSettingsButton
source: Open System Settings
de: Systemeinstellungen öffnen

# dialogNoMeasurementsTitle
source: No measurements found!
de: Keine Messdaten gefunden!

# dialogNoMeasurementsMessage
source: The measurement data could not be read or contains errors.
de: Die Messdaten konnten nicht gelesen werden oder sind fehlerhaft.

# carbonFootprint
source: Based on this Mac's %@ location and average system power, an equivalent of %@ carbon dioxide is emitted per hour you actively use this Mac.
de: Basierend auf dem %@ Standort dieses Macs und seiner durchschnittlichen Leistung, wird pro Stunde, in der Sie diesen Mac aktiv nutzen, ein Äquivalent von %@ Kohlendioxid ausgestoßen.

# carbonFootprintUnavailable
source: Information about this Mac's carbon footprint is currently unavailable.
de: Informationen über den CO2-Fußabdruck dieses Macs sind momentan nicht verfügbar.

# carbonLocationPrecise
source: current
de: aktuellen

# carbonLocationNotPrecise
source: approximate
de: ungefähren

# apiKeyTextCO2Signal
source: Don't have an API key yet? Create your free API key for non-commercial use at https://co2signal.com.
de: Sie haben noch keinen API-Schlüssel? Einen kostenlosen API-Schlüssel zur nicht-kommerziellen Nutzung erhalten Sie auf https://co2signal.com.

# apiKeyTextElectricityMaps
source: Don't have an API key yet? Create your free API key for non-commercial use at https://www.electricitymaps.com.
de: Sie haben noch keinen API-Schlüssel? Einen kostenlosen API-Schlüssel zur nicht-kommerziellen erhalten Sie auf https://www.electricitymaps.com.

# dialogCarbonDataClearTitle
source: Do you want to clear previously imported carbon intensity data?
de: Möchten Sie die bereits importierten CO2-Emissionsdaten löschen?

# dialogCarbonDataClearMessage
source: Clearing the carbon intensity data cannot be undone and also disables the display of the carbon footprint.
de: Das Löschen der CO2-Emissionsdaten kann nicht rückgängig gemacht werden und deaktiviert außerdem die Anzeige des CO2-Fußabdrucks.

# importButtonTitle
source: Import carbon intensity data
de: CO2-Emissionsdaten importieren

# clearButtonTitle
source: Clear carbon intensity data
de: CO2-Emissionsdaten löschen

# dialogImportSuccessTitle
source: Import successful!
de: Import erfolgreich!

# dialogImportSuccessMessage
source: The carbon intensity data for %ld countries were successfully imported.
de: Die CO2-Emissionsdaten für %ld Länder wurden erfolgreich importiert.

# dialogImportErrorTitle
source: Import failed!
de: Import fehlgeschlagen!

# dialogImportErrorMessage
source: There couldn't be any carbon intensity data imported from the selected file. Please check if the file is a valid CSV file with values separated by comma or semicolon and try again.
de: Aus der ausgewählten Daten konnten keine CO2-Emissionsdaten importiert werden. Bitte prüfen Sie, ob die Datei eine gültige CSV-Datei, mit durch Komma oder Semikolon getrennten Werten ist, und versuchen Sie es erneut.

# statusItemCurrentPower
source: Current system power: %@
de: Aktuelle Systemleistung: %@

# statusItemAveragePower
source: Average system power: %@
de: Durchschnittliche Systemleistung: %@

# statusItemCarbonFootprint
source: Carbon footprint: %@CO2eq/h
de: CO2-Fußabdruck: %@CO2eq/h

# statusItemValueUnknown
source: unknown
de: unbekannt

# dialogBackgroundTitle
source: Are you sure you want to run this application in background now?
de: Sind Sie sicher, dass Sie das Programm jetzt im Hintergrund ausführen wollen?

# dialogBackgroundMessage
source: When running in background, all windows of this application will be closed and the application will be displayed only in the macOS menu bar.
de: Wenn es im Hintergrund ausgeführt wird, werden alle Fester des Programms geschlossen und es wird nur noch in der macOS Menüleiste angezeigt.

# dialogLoginItemDisabledTitle
source: Login item not enabled!
de: Anmeldeobjekt ist nicht aktiviert!

# dialogLoginItemDisabledMessage
source: This application's login item needs to be enabled in System Settings for this application to work correctly. Please enable the login item and try again.
de: Das Anmeldeobjekt dieses Programms muss in den Systemeinstellungen aktiviert werden, damit das Programm korrekt funktionieren kann. Bitte aktivieren Sie das Anmeldeobjekt und versuchen Sie es erneut.
